DSTRL/pilot2/userjourneys/pid_retreival.md
```mermaid
sequenceDiagram
    autonumber
    actor student as Student
    participant mobile as Mobile Wallet
    participant pidGUI as uSelf PID Generator
    participant agent as uSelf Issuer Agent
    participant authSource as Authentic Source
    participant db as Postgres DB
    participant ip as Identity Provider
    

Note over student,ip: Pre Authentication/Authorization
    student->>pidGUI: GET http://student-web/issue
    activate pidGUI 
    pidGUI->>ip: GET http://identity-provider/authorize
    activate ip 
    ip-->>pidGUI: student authenticated
    deactivate ip
  

Note over student,ip: Issuing PID 
    pidGUI->>agent: GET http://uself-agent/issuer/credential-offer
    activate agent 
    agent-->>pidGUI: credential_offer
    deactivate agent
    pidGUI->>pidGUI: generate QRCode
    mobile->>pidGUI: read QRCode & user_pin
    
    activate mobile 
    mobile-->>mobile: redirect - http status = 302

    mobile->>agent: GET http://uself-agent/auth/token?user_pin
    activate agent 
    agent-->>mobile: access_token
    deactivate agent
    mobile->>agent: POST http://uself-agent/issuer/credential
    activate agent 
    agent->>authSource: GET http://auth-source/educationalId/pid_identifier
    activate authSource 
    authSource->>db: SELECT * FROM educationalId WHERE pid = pid_identifier
    activate db 
    db-->>authSource: educationalId info
    deactivate db
    authSource-->>agent: educationalId info
    deactivate authSource
    agent-->>pidGUI: send event credential_issued
    agent-->>mobile: credential
    deactivate agent
    deactivate mobile
    deactivate pidGUI
```
